In [1]:
# need to install pandas - "conda install pandas"

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [4]:
ids = ['a', 'b', 'c'] # id list
data = [10, 20, 30]   # data list
arr = np.array(data)  # numpy data array
dic = {'a':10, 'b':20, 'c':30} # dictionary

In [5]:
pd.Series(data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data, ids) # can set actual name shown from shift+tab to clearify pd.Series(data=data, index=ids) if out of order

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr) # can take multiple formats and convert them, numpy array here, dictionary example below

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [15]:
series = pd.Series(['CAN', 'USA', 'MEX', 'UK', 'RU'], [1, 2, 3, 4, 5])

In [19]:
series # notice dtype is object for the strings

1    CAN
2    USA
3    MEX
4     UK
5     RU
dtype: object

In [20]:
series[1] # pulling by label - NOT by index

'CAN'

In [21]:
series_two = pd.Series(['CAN', 'USA', 'WUT', 'UK', 'RU'], [1, 2, 6, 4, 5])

In [23]:
series + series_two # concat (add nums) or NaN if nothing to combine

1    CANCAN
2    USAUSA
3       NaN
4      UKUK
5      RURU
6       NaN
dtype: object

In [1]:
# DATA Frames # a bunch of series, that share an index

In [3]:
from numpy.random import randn

In [16]:
np.random.seed(101) # so that random numbers always generate the same

In [17]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z']) # data, index, columns categories passed

In [23]:
df  # I had it change, until I re-ran? odd, wish i would have saved the output...

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
type(df['W'])

pandas.core.series.Series

In [28]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df.W # another way to format, not recommended as it could be confused between a methods on df and a named column ("keys" for example)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [34]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [35]:
df['WYSUM'] = df['W'] + df['Y'] # create new column wysum which is the sum of column w and y

In [36]:
df

          W         X         Y         Z     WYSUM
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [42]:
df.drop('WYSUM', axis = 1) # will error on axis, arg2 is 0 for x and 1 for y, arg3 inplace=True (if you want to lock changes)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z     WYSUM
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [44]:
df.shape

(5, 5)

In [45]:
# selecting rows

In [50]:
df.loc['A'] # as the columns are a pandas "series", so are the rows - pull by labels

W        2.706850
X        0.628133
Y        0.907969
Z        0.503826
WYSUM    3.614819
Name: A, dtype: float64

In [51]:
df.iloc[2] # by numerical index

W       -2.018168
X        0.740122
Y        0.528813
Z       -0.589001
WYSUM   -1.489355
Name: C, dtype: float64

In [53]:
df.loc['B', 'Y'] # single

-0.84807698340363147

In [56]:
df.loc[['A', 'B'], ['W', 'Y']] # snag sections

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [57]:
df.drop('WYSUM', axis = 1, inplace = True)

In [58]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
# conditional statements on data frames

In [69]:
df > 0 # similar to comparision the numpy array

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [61]:
booldf = df > 0

In [63]:
df[booldf] # use a conditional against a data frame

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df[df > 0] # can also directly dump in as per usual

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [75]:
df[df['W'] > 0] # yank ROW C because < 0 | passing it this way you'll get the proper series back - not the NaN **

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df[df['Z'] < 0] # only pull me the row meeting this condition

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [78]:
resultsdf = df[df['W'] > 0]

In [80]:
resultsdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [89]:
df[df['W'] > 0]['X'] # same as previous in a single liner **

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [90]:
df[df['W'] > 0][['X','Y']] # with multiple fields

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [94]:
boolser = df['W'] > 0 # try and break it down to understand the one liner above
mycols = ['Y', 'X']
result = df[boolser]
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [99]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df[(df['W'] > 0) & (df['Y'] > 1)] # tempted to do "and" but needs to be & for comparison (ambiguity) "or" is | ** for TWIN

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [104]:
df.reset_index() # again, needs inplace to save, old index just becomes a column you could toss

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [111]:
newind = 'CA NY WY OR CO'.split() # nice quick way to populate

In [106]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [107]:
df['States'] = newind

In [108]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [110]:
df.set_index('States') # will actually override old index, needs inplace again of course

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [22]:

# Multi index and Index Hierarchy

In [6]:
# Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [10]:
list(zip(outside, inside)) # create a list of tuples from given list variables - maybe should introduce earlier?

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [12]:
hier_index # interesting

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [26]:
pd.DataFrame(randn(6, 2), hier_index, ['A', 'B']) # this makes more sense | notice no column (index) name for C0 or C1

             A         B
G1 1 -1.368432 -0.316633
   2  0.113257 -1.012904
   3 -0.653492 -2.451303
G2 1  0.105124 -1.264839
   2  1.085175  0.054368
   3  0.991670  0.033003

In [27]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [28]:
df.loc['G1']

          A         B
1  0.963951 -1.397899
2 -1.715300 -0.731170
3 -0.601877 -0.953631

In [30]:
df.index.names # nested indexs c0 and c1 dont have names so...

FrozenList([None, None])

In [33]:
df.index.names = ['Groups', 'Numbers'] # add em in

In [32]:
df

                       A         B
Groups Numbers
G1     1        0.963951 -1.397899
       2       -1.715300 -0.731170
       3       -0.601877 -0.953631
G2     1       -1.425005 -1.219794
       2        1.308045  0.024999
       3       -1.155494  1.861484

In [34]:
df.loc['G2']

                A         B
Numbers
1       -1.425005 -1.219794
2        1.308045  0.024999
3       -1.155494  1.861484

In [36]:
df.loc['G2'].loc[2]['B'] # pull out 2nd row, B value

0.024999248663786555

In [40]:
df

                       A         B
Groups Numbers
G1     1        0.963951 -1.397899
       2       -1.715300 -0.731170
       3       -0.601877 -0.953631
G2     1       -1.425005 -1.219794
       2        1.308045  0.024999
       3       -1.155494  1.861484

In [37]:
df.xs('G1') # cross section

                A         B
Numbers
1        0.963951 -1.397899
2       -1.715300 -0.731170
3       -0.601877 -0.953631

In [42]:
df.xs(2, level='Numbers') # pull the second row of each group

               A         B
Groups
G1     -1.715300 -0.731170
G2      1.308045  0.024999

In [66]:

# dealing with missing values #############################

In [45]:
dic = {'A':[1, 2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1, 2, 3]} # create new sample

In [46]:
dic

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [49]:
df = pd.DataFrame(dic) # dic can be made into a DF

In [50]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [52]:
df.dropna() # no values is drop any row that had a Null value

     A    B  C
0  1.0  5.0  1

In [54]:
df.dropna(axis=1) # drop any columns with no values

   C
0  1
1  2
2  3

In [56]:
df.dropna(thresh=2) # at least 2 Null values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [57]:
df.fillna(value='Fill') # just sub in something

      A     B  C
0     1     5  1
1     2  Fill  2
2  Fill  Fill  3

In [64]:
df['A'].fillna(value=df['A'].mean(), inplace=True) # fill mean of 1 and 2 which is 1.5 (can use tons of formulas here)

In [65]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [4]:

# Groupby

In [5]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [8]:
df = pd.DataFrame(data)

In [9]:
df.groupby('Company')

In [10]:
byCompany = df.groupby('Company')

In [13]:
byCompany.mean() # the person column will be ignored because you cannot do a mean on a (string)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [14]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [15]:
byCompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [16]:
byCompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [18]:
 df.groupby('Company').sum().loc['FB'] # toss the previous into a one liner

Sales    593
Name: FB, dtype: int64

In [19]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [20]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [24]:
df.groupby('Company').describe() # give you back a bunch of the information!

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [25]:
df.groupby('Company').describe().transpose() # change the format

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [27]:
df.groupby('Company').describe().transpose()['MSFT'] # specific column

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64

In [28]:

# Merge, join, concat

In [29]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [30]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [31]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [32]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [33]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [34]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [38]:
pd.concat([df1, df2, df3]) # know your dimensions

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [37]:
pd.concat([df1, df2, df3], axis = 1) # make sure the information lines up properly

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [39]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [40]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [41]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [42]:
 # merge

In [44]:
pd.merge(left, right, how='inner', on='key') # combine left and right using the key - concat would have 2x key # SQL like joins

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [46]:
# something a bit more complex, multiple keys

left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [47]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [50]:
pd.merge(left, right, how='outer', on=['key1', 'key2']) # outer style

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [53]:
pd.merge(left, right, how='right', on=['key1', 'key2']) # right style

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [58]:
# joining - combining columns of 2 potentially differently indexed DataFrames into a single result DF
#           use them when you have an index you can use

In [55]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [56]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [57]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [59]:

# Operations on data frames

In [60]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [61]:
df ['col2'].unique()

array([444, 555, 666])

In [64]:
df ['col2'].nunique() # how many unique - same as len(df['col2'].unique())

3

In [65]:
df ['col2'].value_counts() # count out how many unique

444    2
555    1
666    1
Name: col2, dtype: int64

In [66]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [71]:
df[(df['col1'] > 1) & (df['col2'] == 444)] # where col1 > 2 and col2 == 444 # not a good example of this useful tool

   col1  col2 col3
3     4   444  xyz

In [72]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [81]:
# apply method - applying your own methods to a DF OR any methods for that matter (imported perhaps?)

In [77]:
def times2(x):
    return x*2

In [78]:
df['col1'].apply(times2) # calling your own method

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [83]:
df['col3'].apply(len) # applying the built in len method

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [85]:
df['col3'].apply(lambda x: x*2) # creating a lambda (single use) method inside an apply!

0    abcabc
1    defdef
2    ghighi
3    xyzxyz
Name: col3, dtype: object

In [86]:
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [88]:
df.columns # helps if youve got wonky titles

Index(['col1', 'col2', 'col3'], dtype='object')

In [90]:
df.index # more information about the data frame, especially useful after imports

RangeIndex(start=0, stop=4, step=1)

In [91]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [93]:
df.sort_values('col2') # "by" or first arg

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [95]:
df.isnull() # return anything in the array that isnull

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [96]:

# pivot tables - creating a multi index table

In [97]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [98]:
df # notice repeating values

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [101]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C']) # want D, so make an A, B multi-index, the X and Y columns

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [102]:
# for the above

# D is the information populated, notice the NaN because there is no (bar, two x) only (bar, two, y)
# A an B as 2 nested in 2
# C is just an FYI on the column selection